////坑人题目
////以下程序段执行后结果是什么：
//for (int i = 0; i < 5; i++, i++);//答案选D，就是因为这个分号
//printf("*");
//A.
//****
//B.
//***
//C.
//**
//D.
//*
// …………………………………………………………
//#include <stdio.h>
//
//int main()
//
//{
//
//    int n = 0;
//
//    while (n++ <= 2)//这个也很坑，在判断的时候+1
//
//        printf("%d", n);
//
//    return 0;
//
//}
////所以输出的是123而不是012
//………………………………………………
//#include<stdio.h>
//
//int main()
//{
//
//    int i, j, x = 0;
//    for (i = 0; i < 2; i++)
//    {
//        x++;
//        for (j = 0; j < 3; j++)
//        {
//            if (j % 2) continue;
//            x++;
//        }
//        x++;
//    }
//    printf("x=%d", x);
//
//    return 0;
//}
////这个题目还是比较常规，但是这个if语句容易理解错
//要使得以下程序的运行结果为2500，请补全程序代码 。

//#include"stdio.h"
//
//main() {
//
//	int i, s;
//
//	i = 1; s = 0;
//
//	while (i < 100) {
//
//		s = s + i;
//
//		i++;//这个是空
//
//	}
//
//	printf("%d\n", s);
//
//}
////参考答案
////i = i + 2;
////这个题目纯粹考数学
//最后补充一下数组的填空题要注意下标经常都要(--i)